---
kind: type
id: T:Autodesk.Revit.DB.DocumentPreviewSettings
source: html/e38ea350-9951-ee05-5e3d-ab7f31815fb3.htm
---
# Autodesk.Revit.DB.DocumentPreviewSettings

Contains the settings related to the saving of preview images for a given document.

## Syntax (C#)
```csharp
public class DocumentPreviewSettings : IDisposable
```